In [1]:
import numpy as np
from pandas import Series, DataFrame 
import pandas as pd

In [2]:
dframe = DataFrame(np.arange(8).reshape(2,4),
                    index = pd.Index(['LA','SF'],name='city'),
                    columns = pd.Index(['A','B','C','D'], name='letter'))

In [3]:
dframe

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [4]:
dframe_st = dframe.stack()

In [5]:
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [6]:
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [7]:
dframe_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [8]:
dframe_st.unstack('letter')

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [9]:
ser1 = Series([1,2,3], index=['Q','W','E'])

ser2 = Series([4,5,6], index=['A','S','D'])

In [10]:
dframe = pd.concat([ser1,ser2], keys=['alpha','beta'])

In [11]:
dframe

alpha  Q    1
       W    2
       E    3
beta   A    4
       S    5
       D    6
dtype: int64

In [12]:
dframe.unstack()

         A    D    E    Q    S    W
alpha  NaN  NaN  3.0  1.0  NaN  2.0
beta   4.0  6.0  NaN  NaN  5.0  NaN

In [13]:
dframe.unstack().stack()    #fill the null values

alpha  E    3.0
       Q    1.0
       W    2.0
beta   A    4.0
       D    6.0
       S    5.0
dtype: float64

In [14]:
dframe = dframe.unstack()

In [15]:
dframe

         A    D    E    Q    S    W
alpha  NaN  NaN  3.0  1.0  NaN  2.0
beta   4.0  6.0  NaN  NaN  5.0  NaN

In [16]:
dframe.stack()

alpha  E    3.0
       Q    1.0
       W    2.0
beta   A    4.0
       D    6.0
       S    5.0
dtype: float64

In [17]:
dframe.stack(dropna=False)   # kepps the null values od dataframe

alpha  A    NaN
       D    NaN
       E    3.0
       Q    1.0
       S    NaN
       W    2.0
beta   A    4.0
       D    6.0
       E    NaN
       Q    NaN
       S    5.0
       W    NaN
dtype: float64